Revit 2024 API
CurvedEdgeConditionParam Enumeration
 The allowed values for the HOST_SSE_CURVED_EDGE_CONDITION_PARAM parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum CurvedEdgeConditionParam
Visual Basic
Public Enumeration CurvedEdgeConditionParam
Visual C++
public enum class CurvedEdgeConditionParam
Members
Member name | Description
NotApplicable |  Not Applicable
ConformToCurve |  Conform to curve
ProjectToSideFace |  Project to side
See Also
Autodesk.Revit.DB Namespace